backend-webapp/DBS-backend/app/views/users/index.html.erb

        <td>
          <% user.accounts.each do |acc| %>
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 549]]

        </td>
        <td><%= "#{Paynow.where(phone: user.phone).first ? Paynow.where(phone: user.phone).first.paid_bef_phone_num : ""}"  %></td>
---
SELECT "paynows".* FROM "paynows" WHERE "paynows"."phone" = ? ORDER BY "paynows"."id" ASC LIMIT ?  [["phone", "+6588888888"], ["LIMIT", 1]]