backend_cloudSQL_latest/app/controllers/disputes_controller.rb

SELECT "disputes".* FROM "disputes" WHERE (disputee_id = '1' AND status = 'Dispute Filed')
---
  def new_disputes_received()

    num_disputes=Dispute.where("disputee_id = ? AND status = ?", params[:id],"Dispute Filed").length

SELECT "disputes".* FROM "disputes" WHERE (disputer_id = '2'  AND transaction_id = '16') ORDER BY "disputes"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "disputes" SET "status" = $1, "updated_at" = $2, "further_action" = $3 WHERE "disputes"."id" = $4
---
  def withdraw_dispute()
    dispute_params = params.permit(:date_and_time, :day_and_date)
    #date_and_time = params[:'date and time']
    #day_and_date = params[:'day and date']



    #update status and check if withdrawable
    #make sure user is the disputer

    dispute=Dispute.where("disputer_id = ?  AND transaction_id = ?", params[:id],params[:transactions_id]).first
    if dispute
      if dispute.is_withdrawable(params[:id])
        dispute.status="Withdrawn"
        dispute.further_action={
           withdraw_date_time: dispute_params[:date_and_time],
           withdraw_day_date:dispute_params[:day_and_date]
      }.to_json
      if dispute.save

SELECT "disputes".* FROM "disputes" WHERE (disputee_id = '2'  AND transaction_id = '14') ORDER BY "disputes"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "disputes" SET "status" = $1, "updated_at" = $2, "further_action" = $3 WHERE "disputes"."id" = $4
---
  def refute_dispute()
    dispute_params = params.permit(:date_and_time, :day_and_date, :refutereason)

    #update status and check if it 'Raised to DBS' or 'Dispute Filed'
    #make sure user is the disputee
    dispute=Dispute.where("disputee_id = ?  AND transaction_id = ?", params[:id],params[:transactions_id]).first
    puts dispute==nil
    if dispute
      if dispute.status=='Raised to DBS' || dispute.status=='Dispute Filed'
        dispute.status='Refuted'
        dispute.further_action={
           refute_date_time: dispute_params[:date_and_time],
           refute_day_date:dispute_params[:day_and_date] ,
           refutereason: dispute_params[:refutereason]
      }.to_json
      if dispute.save

SELECT "disputes".* FROM "disputes" WHERE (disputee_id = '1'  AND transaction_id = '15') ORDER BY "disputes"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "disputes" SET "status" = $1, "updated_at" = $2, "further_action" = $3 WHERE "disputes"."id" = $4  [["status", "Resolved"], ["updated_at", "2023-07-24 07:34:51.854908"], ["further_action", "{\"resolve_date_time\":\"'6 July 2023 04:22'\",\"resolve_day_date\":\"'Thu, 6 July 2023'\"}"], ["id", 2]]
---
  def resolve_dispute()

    #update status and check if it 'Raised to DBS' or 'Dispute Filed'
    #make sure user is the disputee
    #make sure to carry out the transaction in the same method that it was used
    dispute_params = params.permit(:date_and_time, :day_and_date, :comments)


    dispute=Dispute.where("disputee_id = ?  AND transaction_id = ?", params[:id],params[:transactions_id]).first
    if dispute
      if dispute.status=='Raised to DBS' || dispute.status=='Dispute Filed'


        dispute.status='Resolved'
        dispute.further_action={
           resolve_date_time: dispute_params[:date_and_time],
           resolve_day_date:dispute_params[:day_and_date ],

      }.to_json
        if dispute.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-2"], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "disputes".* FROM "disputes" WHERE "disputes"."transaction_id" = $1 LIMIT $2  [["transaction_id", 15], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-4"], ["LIMIT", 1]]
---
 def refund_details  #assuming intrabank


    transaction=Transaction.find(params[:transactions_id])
    disputee_acc=Account.where(account_number: transaction.recipient_account_number).first



    if transaction && disputee_acc

      isModeOfPaymentPaynow=(transaction.transaction_type=="FAST / PayNow Transfer")


      dispute=transaction.dispute
      dispute_reason_details=JSON.parse(dispute.dispute_reason_details)
      isWrongAmount=(dispute.dispute_reason=="Transfer Wrong Amount")


      data=[ {"refund details": {
    "transfer from acc name": disputee_acc.account_type,
    "transfer from acc number": transaction.recipient_account_number,
    "recipient name": Account.where(account_number: transaction.account.account_number).first.user.username,
    "recipient acc": transaction.account.account_number,
    "total amount": isWrongAmount ? transaction.amount-dispute_reason_details["correct_amount"] : transaction.amount,
    "mode of payment": isModeOfPaymentPaynow ? "FAST / PayNow Transfer" : "Account Transfer",
    "contact details": dispute_reason_details["contact_details"]

  }
    }]

SELECT "disputes".* FROM "disputes"
---
  def index
    @disputes=Dispute.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def transaction_detail_for_disputes_involving_user
    user=User.find_by_id(params[:id])

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def create

    disputer_id=params[:user_id]
    transaction_id=params[:transaction_id]
    dispute_params = params.permit(:date_and_time, :day_and_date, :reason,:comments ,:user,:transaction_ID,:contact_details,:correct_amount)
    date_and_time = dispute_params[:date_and_time]
    day_and_date = dispute_params[:day_and_date]
    dispute_reasons = dispute_params[:reason]
    dispute_comments= dispute_params[:comments]
    role=dispute_params[:user]#sender or recipient of funds
    params.inspect




    transaction=Transaction.find(transaction_id)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-4"], ["LIMIT", 1]]
---
        #get  recipient of this transaction and remove from users's paid_before phone numbers
        begin
          puts "delete"
        other_party=Account.where(account_number: transaction.recipient_account_number).first

SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-4"], ["LIMIT", 1]]
---

      end

      transaction_recipient_account=Account.where(account_number: transaction.recipient_account_number).first

SELECT "disputes".* FROM "disputes" WHERE (disputer_id = '13'  AND transaction_id = NULL) ORDER BY "disputes"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def set_dispute
      @dispute = Dispute.find(params[:id])