backend_cloudSQL_latest/app/controllers/paynows_controller.rb

  def search_by_phone
    phone_num=params[:phone]
    paynow_entry=PayNow.where(phone: phone_num).first
---
SELECT "paynows".* FROM "paynows" WHERE "paynows"."phone" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["phone", "+6588888888"], ["LIMIT", 1]]

  def search_by_phone

    #1.get current user phone given user id
    #2.go paynow db get acc numbner current user
    #3. go acc db get acc type current user
    #4.go paynow db get other party's acc num and nickname by phone

    #paynow db: phone,accnum,bank,nickname, no associations

    begin
    current_party=User.find(params[:id].to_s)
    current_phone=current_party.phone #1
    current_accnum=Paynow.get_accnum(current_phone)#2-usraccnum
    current_acctype=Account.where(account_number: current_accnum).first.account_type #3-usraccname
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 541], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-2"], ["LIMIT", 1]]