backend_cloudSQL_latest/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])