backend_cloudSQL_latest/app/controllers/transactions_controller.rb

  def all_transactions
    @user=User.find(params[:id])
    #outgoing
    outgoing_7_days=@user.transactions.where("datetime >= ?", 7.days.ago.to_date)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" INNER JOIN "accounts" ON "transactions"."account_id" = "accounts"."id" WHERE "accounts"."user_id" = $1 AND (datetime >= '2023-07-30')  [["user_id", 1]]

  def create
    transaction_params = params.permit(:transfer_from_acc_number, :recipient_acc, :recipient_bank, :total_amount,:comments,:mode_of_payment,:date_and_time,:day_and_date,:transfer_type)
    #transfer_from_acc_number = params[:transfer_from_acc_number]

    #recipient_acc = params[:recipient_acc]
    #recipient_bank=params[:recipient_bank] #more for general transactions
    #total_amount = params[:total_amount]
    #comments = params[:comments]
    #mode_of_payment = params[:mode_of_payment]
    #date_and_time = params[:date_and_time]
    #day_and_date = params[:day_and_date]
    #transfer_type = params[:transfer_type]
    transfer_from_acc_number= transaction_params[:transfer_from_acc_number]
    begin
    isRecipientDBS=(transaction_params[:recipient_bank]=='DBS' || transaction_params[:recipient_bank]=='DBS/POSB')
  rescue => e
    puts "An error of type #{e.class} happened, message is #{e.message}"
  end

    sender_acc=Account.where(account_number: transfer_from_acc_number).first
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = $1 ORDER BY "accounts"."id" ASC LIMIT $2  [["account_number", "539-23421-2"], ["LIMIT", 1]]



    if sender_acc
      created_transaction=sender_acc.transactions.create(
      transaction_name: transaction_params[:transfer_type], #display
      transaction_type: transaction_params[:mode_of_payment], #internal use
      recipient_account_number: recipient_acc,
      datetime: DateTime.strptime(transaction_params[:day_and_date], "%a, %d %b %Y"),
      amount: transaction_params[:total_amount],
      comments:transaction_params[:comments],
      date_time: transaction_params[:date_and_time],
      intrabank:isRecipientDBS
    )
    #--------if trf type is paynow, add phone num  to paid bef list of current user----------
    if transaction_params[:mode_of_payment]=="FAST / PayNow Transfer"
      #will not do anytg if paynow is not avail for that acc
      Paynow.update_if_not_paid_before_else_nothing(transfer_from_acc_number,transaction_params[:recipient_acc])
---
INSERT INTO "transactions" ("transaction_name", "transaction_type", "recipient_account_number", "datetime", "amount", "created_at", "updated_at", "account_id", "comments", "date_time", "intrabank") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
UPDATE "paynows" SET "updated_at" = $1, "paid_bef_phone_num" = $2 WHERE "paynows"."id" = $3  [["updated_at", "2023-07-24 07:24:04.170077"], ["paid_bef_phone_num", "---\n- \"+6588888887\"\n"], ["id", 2]]

    def set_transaction
      @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]