backend_cloudSQL_latest/app/controllers/users_controller.rb

  def login


    begin
      user_params = params.require([:username, :pin])

    rescue ActionController::ParameterMissing => e
      render json: { success: false, error: e.message }, status: :unprocessable_entity
      return
    end

    user=User.where(username: user_params[0], password: user_params[1]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["username", "junxiang"], ["password", "[FILTERED]"], ["LIMIT", 1]]