backend-webapp/DBS-backend/app/controllers/disputes_controller.rb

SELECT "disputes".* FROM "disputes" WHERE "disputes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def resolve_dispute()

    #update status and check if it 'Raised to DBS' or 'Dispute Filed'
    #make sure user is the disputee
    #make sure to carry out the transaction in the same method that it was used
    date_and_time = params[:'date and time']
    day_and_date = params[:'day and date']

    dispute=Dispute.where("disputee_id = ?  AND transaction_id = ?", params[:user_id],params[:transaction_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 221], ["LIMIT", 1]]
---
  def transaction_detail_for_disputes_involving_user
    user=User.find_by_id(params[:user_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 289], ["LIMIT", 1]]
---
  def create
    date_and_time = params[:'date and time']
    day_and_date = params[:'day and date']
    dispute_reasons = params[:'reason']
    dispute_comments= params[:'comments']
    transaction_id=params[:'transaction ID']
    transaction=Transaction.find(params[:transaction_id])
    disputer_id=params[:'user_id']
    role=params[:'user']#sender or recipient of funds


    #assume intrabank
    if(transaction.intrabank)
      senderIsDisputer=(transaction.account.user.id==disputer_id)
      transaction_recipient_account=Account.where("account_number == ?",transaction.recipient_account_number)