backend-webapp/DBS-backend/app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def show
    user=User.find_by_id(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 157], ["LIMIT", 1]]

  def create
    transaction_params = params.permit(:transfer_from_acc_number, :recipient_acc, :recipient_bank, :total_amount,:comments,:mode_of_payment,:date_and_time,:day_and_date,:transfer_type)
    #transfer_from_acc_number = params[:transfer_from_acc_number]

    #recipient_acc = params[:recipient_acc]
    #recipient_bank=params[:recipient_bank] #more for general transactions
    #total_amount = params[:total_amount]
    #comments = params[:comments]
    #mode_of_payment = params[:mode_of_payment]
    #date_and_time = params[:date_and_time]
    #day_and_date = params[:day_and_date]
    #transfer_type = params[:transfer_type]
    transfer_from_acc_number= transaction_params[:transfer_from_acc_number]
    begin
    isRecipientDBS=(transaction_params[:recipient_bank]=='DBS' || transaction_params[:recipient_bank]=='DBS/POSB')
  rescue => e
    puts "An error of type #{e.class} happened, message is #{e.message}"
  end

    sender_acc=Account.where(account_number: transfer_from_acc_number).first
    if sender_acc
      created_transaction=sender_acc.transactions.create(
      transaction_name: transaction_params[:transfer_type], #display
      transaction_type: transaction_params[:mode_of_payment], #internal use
      recipient_account_number: transaction_params[:recipient_acc],
      datetime: DateTime.strptime(transaction_params[:day_and_date], "%a, %d %b %Y"),
      amount: transaction_params[:total_amount],
      comments:transaction_params[:comments],
      date_time: transaction_params[:date_and_time],
      intrabank:isRecipientDBS
    )
    #--------if trf type is paynow, add phone num  to paid bef list of current user----------
    if transaction_params[:mode_of_payment]=="FAST / PayNow Transfer"
      #will not do anytg if paynow is not avail for that acc
      Paynow.update_if_not_paid_before_else_nothing(transfer_from_acc_number,transaction_params[:recipient_acc])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["account_number", "\"539-23421-2\""], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_name", "transaction_type", "recipient_account_number", "datetime", "amount", "created_at", "updated_at", "account_id", "comments", "date_time", "intrabank") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "paynows" SET "updated_at" = ?, "paid_bef_phone_num" = ? WHERE "paynows"."id" = ?  [["updated_at", "2023-07-17 18:57:00.933419"], ["paid_bef_phone_num", "---\n- \"+6588888887\"\n"], ["id", 2]]

    def set_transaction
      @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]