backend-webapp/DBS-backend/app/controllers/transactions_controller.rb

    def set_transaction
      @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]