backend-webapp/DBS-backend/app/controllers/users_controller.rb

SELECT "transactions".* FROM "transactions" INNER JOIN "accounts" ON "transactions"."account_id" = "accounts"."id" WHERE "accounts"."user_id" = ? AND (datetime >= '2023-06-13')  [["user_id", 22]]
---
  def all_transactions
    #outgoing
    outgoing_7_days=@user.transactions.where("datetime >= ?", 7.days.ago.to_date)

SELECT "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "junxiang"], ["password", "[FILTERED]"], ["LIMIT", 1]]
---
  def login


    begin
      user_params = params.require([:username, :pin])

    rescue ActionController::ParameterMissing => e
      render json: { success: false, error: e.message }, status: :unprocessable_entity
      return
    end

    user=User.where(username: user_params[0], password: user_params[1]).first

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["user_id", 541], ["LIMIT", 1]]
---
  def default_acc
    default_acc=@user.accounts.first