backend-webapp/DBS-backend/app/controllers/users_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ?  [["user_id", 9]]
---
  def list_accounts

    accounts=[]
    account_ids=[]
    @user.accounts.each do |account|