backend-webapp/DBS-backend/app/models/account.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."recipient_account_number" = ?  [["recipient_account_number", "539-23421-7"]]
---
    def incoming_transactions #checked
        Transaction.where(recipient_account_number: self.account_number)