backend-webapp/DBS-backend/app/models/transaction.rb

    def get_other_party_name
        acc=Account.where(account_number: self.recipient_account_number)
        other_username=" "
        acc.each do |other_party_acc|  #this is cus .where return collection even tho only 1 user
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_number" = ?  [["account_number", "539-23421-2"]]