backend_cloudSQL_latest/app/models/account.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."recipient_account_number" = $1  [["recipient_account_number", "539-23421-2"]]
---
    def incoming_transactions #checked,for acc route
        Transaction.where(recipient_account_number: self.account_number)