backend_cloudSQL_latest/app/models/dispute.rb

SELECT "disputes".* FROM "disputes" WHERE (disputee_id = 2 OR disputer_id = 2)
---
def self.transaction_detail_for_disputes_involving_user(user)
#order from latest to earliest

    disputes=Dispute.where("disputee_id = ? OR disputer_id = ?", user.id,user.id).sort_by { |obj| Date.strptime(obj[:day_date].split(', ').last, '%d %B %Y') }.reverse