backend_cloudSQL_latest/app/models/paynow.rb

SELECT "paynows".* FROM "paynows" WHERE "paynows"."phone" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["phone", "+6588888888"], ["LIMIT", 1]]
---
    def self.get_accnum(phone)

        paynow=Paynow.where(phone: phone).first

SELECT "paynows".* FROM "paynows" WHERE "paynows"."phone" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["phone", "+6588888887"], ["LIMIT", 1]]
---
    def self.get_nickname(phone)
        paynow=Paynow.where(phone: phone).first

SELECT "paynows".* FROM "paynows" WHERE "paynows"."phone" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["phone", "+6588888888"], ["LIMIT", 1]]
---
    def self.paid_before(user_phone,other_phone)
        paynow=Paynow.where(phone: user_phone).first

SELECT "paynows".* FROM "paynows" WHERE "paynows"."accnum" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["accnum", "539-23421-2"], ["LIMIT", 1]]
UPDATE "paynows" SET "updated_at" = $1, "paid_bef_phone_num" = $2 WHERE "paynows"."id" = $3  [["updated_at", "2023-07-24 07:24:29.376345"], ["paid_bef_phone_num", nil], ["id", 2]]
---
    def self.remove_from_paid_before(user_accnum,other_phone)
        paynow=Paynow.where(accnum: user_accnum).first
        begin


            paynow.paid_bef_phone_num.delete(other_phone)
            paynow.save

SELECT "paynows".* FROM "paynows" WHERE "paynows"."accnum" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["accnum", "539-23421-2"], ["LIMIT", 1]]
SELECT "paynows".* FROM "paynows" WHERE "paynows"."accnum" = $1 ORDER BY "paynows"."id" ASC LIMIT $2  [["accnum", "539-23421-4"], ["LIMIT", 1]]
UPDATE "paynows" SET "updated_at" = $1, "paid_bef_phone_num" = $2 WHERE "paynows"."id" = $3  [["updated_at", "2023-07-24 07:24:04.170077"], ["paid_bef_phone_num", "---\n- \"+6588888887\"\n"], ["id", 2]]
---
    def self.update_if_not_paid_before_else_nothing(user_acc_num,recipient_acc_num)
        user_paynow=Paynow.where(accnum: user_acc_num).first
        recipient_paynow=Paynow.where(accnum: recipient_acc_num).first
        if (user_paynow && recipient_paynow)

            begin

                paid_bef_phone_num=user_paynow.paid_bef_phone_num
                if (!paid_bef_phone_num.include?(recipient_paynow.phone))

                    user_paynow.paid_bef_phone_num<<recipient_paynow.phone
                    user_paynow.save